{
  "_attn_implementation_autoset": true,
  "_name_or_path": "tanaos/tanaos-emotion-detection-v1",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "id2label": {
    "0": "joy",
    "1": "anger",
    "2": "fear",
    "3": "sadness",
    "4": "surprise",
    "5": "disgust",
    "6": "excitement",
    "7": "neutral"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "anger": 1,
    "disgust": 5,
    "excitement": 6,
    "fear": 2,
    "joy": 0,
    "neutral": 7,
    "sadness": 3,
    "surprise": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "XLMRobertaTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 250037
}
